Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetDeletePartFailureState(System.Boolean)
Set the state to delete or keep the element if errors are posted by changing the service. Set to true so the mappings are applied otherwise false.
Since:
2026.4

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetDeletePartFailureState
Get the state if the element will be deleted when change the service encounters an error or not.
Returns:
Returns true if if the element will be deleted otherwise false.
Since:
2026.4

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetPartTypeMappingState(System.Boolean)
Set the state to enable or disable part type mappings when changing the service. Set to true so the mappings are applied otherwise false.
Since:
2026.4

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetPartTypeMappingState
Get the state for part type mapping.
Returns:
Returns true if part type mapping is enabled otherwise false.
Since:
2026.4

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.GetPartTypesforMapping
Get a set of element identifiers of fabrication part types that can be mapped.
Returns:
Returns the set of element identifiers for part types or an empty set if there are none.
Since:
2026.4

Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetPartTypesforMapping(System.Collections.Generic.IDictionary{Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId})
Set a map of element identifiers of fabrication part types that will be mapped when the change service is applied. When part types in the map are encountered, they will be updated to the associated map component. This overrides the default parts that can be used by route and fill solutions driven by the fabrication configuration and service.
Set the fabrication part types for parts for the service and palette to map too.
Remarks:
After this method has been invoked, call:
Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeService.SetPartTypeMappingState(System.Boolean) to enable or disable the use of the part type mappings when the change service is applied.
fabricationPartTypes:
The map containing the original fabrication part type to the mapped fabrication part type to change to.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2026.4